Repository: hackinscience/hkis-website
Catalog: website/locale/*/LC_MESSAGES/django.po
Languages: fr

source: E-mail (optional)
fr: E-mail (facultatif)

source: About Hackinscience
fr: À propos de Hackinscience

source: Hackinscience, the online platform
fr: Hackinscience, la plateforme en ligne

source: The Hackinscience platform is a free, without ads, and open-source (<a href="http://framagit.org/hackinscience/">repo on framagit</a>) exercise platform, by a [team](%(team_url)s) of Python passionates.
fr: La plateforme Hackinscience est une plateforme d'entrainement libre, sans publicité et open-source (<a href="http://framagit.org/hackinscience/">dépôt sur framagit</a>), par une [équipe](%(team_url)s) de passionés du langage Python.

source: We only rely on [your donations](https://liberapay.com/JulienPalard) to run this.
fr: Nous comptons uniquement sur [vos dons](https://liberapay.com/JulienPalard) pour maintenir ce site.

source: You're a teacher?
fr: Vous êtes un·e professeur·e ?

source: If you're a teacher and want to use hackinscience during your courses, you can ask by email at team at hackinscience dot org for a teacher account, we'll bind you to your class students so you can follow their individual progression.
fr: Si vous êtes un·e professeur·e et que vous souhaitez utiliser hackinscience pendant vos cours, vous pouvez demander un compte professeur par mail à team at hackinscience point org, nous vous rattacherons à vos étudiants de manière à ce que vous puissiez suivre leur progression individuelle.

source: You'd like The Hackinscience Team for a class?
fr: Vous aimeriez avoir l'équipe Hackinscience pour un cours ?

source: Good news, we teach Python too! Don't hesitate to drop us an email at team at hackinscience dot org and we'll discuss about it. We're based in Paris, France, but it may be OK for the team to move in other places, let's talk about it!
fr: Bonne nouvelle, nous enseignons aussi le Python ! N'hésitez pas à nous laisser un mail à team at hackinscience point org et nous pourrons ne discuter. Nous sommes basés à Paris, France, mais il est peut-être possible à l'équipe de se déplacer dans d'autres lieux, parlons-en !

source: Friendly Tracebacks in corrections
fr: Explications améliorées dans les corrections

source: You may have spotted Python exceptions are often nicely explained, how do we do that?
fr: Vous avez peut-être remarqué que les exceptions Python trouvées sont souvent bien expliquées, comment faisons-nous ?

source: We're using André Roberge's [friendly-traceback](https://github.com/aroberge/friendly-traceback/), a project which tries to understand what caused the exception, and explain it.
fr: Nous utilisons le [friendly-traceback](https://github.com/aroberge/friendly-traceback/) d'André Roberge, un projet qui essayes de comprendre ce qui a causé une exception, et de l'expliquer.

source: If you spot an exception that is not explained by `friendly-traceback`, which end up with "You might want to report this case to ...", don't hesitate to report the case to the given link, André is always very fast to implement the case and it will help many people, not only hackinscience users!
fr: Si vous découvrez une exception non expliquée par `friendly-traceback`, qui finit par "You might want to report this case to ...", n'hésitez pas à rapporter le cas via le lien, André est toujours prompt à ajouter ce cas précis et cela aidera beaucoup d'auters personnes, pas seulement les utilisateurs de Hackinscience !

source: In the other hand if you spot a correction message that is not helpfull and does not give a link to `friendly-traceback`, please open an issue on [hackinscience](framagit.org/hackinscience/hkis-website)'s issue tracker, as it's probably to be enhanced in our side.
fr: Par ailleurs, si vous découvrez un message de correction qui n'aide pas vraiment et ne fournit pas de lien vers `friendly-traceback`, merci d'ouvrir un ticket sur notre [gestionnaire de tickets](framagit.org/hackinscience/hkis-website), étant donné qu'il s'agit certainement d'une amélioration à faire de notre côté.

source: Privacy
fr: Vie privée

source: Personal informations
fr: Informations personnelles

source: When registering and using the Hackinscience platform, we store some informations about you:
fr: Quand vous vous enregistrez et utilisez la plateforme Hackinscience, nous conservons certaines informations :

source: Your username, maybe your email if you gave it at registration time.
fr: Votre nom d'utilisateur, et votre adresse mail si vous l'avez fournie à l'inscription.

source: All the exercises you did, when you did them, what you submitted, what the bot answered.
fr: Tous les exercices que vous faites, quand vous les faites, ce que vous avez soumis, et ce que le robot a répondu.

source: Why do we store all your submissions?
fr: Pourquoi stockons-nous toutes les soumissions ?

source: To display ✓ and ✗ marks near exercises so you know which one you succeeded and which one to do.
fr: Afin d'afficher les signes ✓ et ✗ prêt des exercices, afin de vous indiquer lesquels vous avez réussi et ceux encore à faire.

source: So you can find them back tomorrow.
fr: Afin que vous puissiez les retrouver plus tard.

source: Compute some statistics to spot which exercises are too hard to order them better or introduce intermediate/easier ones.
fr: Pour calculer des statistiques afin de voir quels exercices sont trop durs pour mieux les réordonner ou en ajouter des intermédiaires.

source: If you want to correct an information we've got about you, delete it, or if you'd like all the data about you conveniently archived for offline reading, feel free to send a mail to *team at hackinscience dot org* or ask any member of [the team](%(team_url)s).
fr: Si vous souhaitez corriger une information stockée sur vous, la supprimer, ou bien encore récupérer l'ensemble de vos données, envoyez un mail à "team at hackinscience point org" ou demandez à un membre de [l'équipe](%(team_url)s).

source: Trackers, external analytics tools, advertising
fr: Trackers, outils d'analyse externes, publicité

source: We do not use any trackers, nor any advertising network, all our `css` and `js` are hosted by ourself (no CDN).
fr: Nous n'utilisons pas de tracker, ni de réseau de publicité, tous nos fichiers `css` et `javascript` sont hébergés en interne (pas de CDN).

source: If you read this, you probably don't like being tracked, there's two complementary things you can do:
fr: Si vous lisez ceci, vous n'aimez probablement pas être tracé, il y a deux choses supplémentaires que vous pouvez faire :

source: Enable the "Do Not Track" flag in your browser
fr: Activer l'option "Do Not Track" de votre navigateur

source: Install the [Privacy Badger](https://fr.wikipedia.org/wiki/Privacy_Badger) browser extension from the [Electronic Frontier Foundation](https://fr.wikipedia.org/wiki/Electronic_Frontier_Foundation).
fr: Installer l'extension de navigateur [Privacy Badger](https://fr.wikipedia.org/wiki/Privacy_Badger) de [l'Electronic Frontier Foundation](https://fr.wikipedia.org/wiki/Electronic_Frontier_Foundation).

source: Privacy Badger blocks advertisements and tracking cookies that do not respect the Do Not Track setting in a user's web browser.
fr: Privacy Badger bloque les publicités et les cookies de traçage qui ne respectent pas l'option Do Not Track.

source: Submit
fr: Envoyer

source: Welcome!
fr: Bienvenue !

source: Next
fr: Suivant

source: Need help?
fr: Besoin d&#39;aide ?

source: Your new <a href="%(profile_url)s">rank</a> is: NEW_RANK
fr: Vous êtes maintenant classé <a href="%(profile_url)s">NEW_RANKème</a>.

source: <a href="%(login_url)s">Login</a> to backup your code and progression.
fr: <a href="%(login_url)s">Connectez-vous</a> pour sauvegarder votre code et votre progression.

source: Waiting for correction
fr: En attente de correction

source: Waiting for test run
fr: Exécution en attente

source: Connecting to correction server…
fr: Connexion au serveur de correction en cours…

source: Connected to correction server.
fr: Connecté au serveur de correction!

source: Connection to correction server lost, will retry in 5s…
fr: La connexion au serveur de correction a échouée. Nouvelle tentative dans 5s…

source: Cannot connect to correction server, will retry in 5s…
fr: Impossible de se connecter au serveur de correction. Nouvelle tentative dans 5s…

source: (See the <a href='%(help_url)s#FAQ'>FAQ</a> if it persists.)
fr: (Consultez la <a href='%(help_url)s#FAQ'>FAQ</a> si le problème persiste.)

source: Created by %(first_name)s %(last_name)s
fr: Par %(first_name)s %(last_name)s

source: Use this to execute your code, so you can try things.
fr: Utilisez ce bouton pour exécuter votre code, cela vous permet de tester des choses.

source: Run
fr: Exécuter

source: Python exercises
fr: Exercices Python

source: Solved by %(nb)s
fr: Résolu %(nb)s fois

source: Getting help
fr: Obtenir de l'aide

source: Report a bug on hackinscience
fr: Signaler une erreur sur Hackinscience

source: If you found an issue in an exercise, or the website, please either: - Fill a bug [in our bugtracker](https://framagit.org/hackinscience/hkis-website/issues). - Send me an email: [julien@palard.fr](mailto:julien@palard.fr).
fr: Si vous avez trouvé un bug sur le site, dans la moulinette de correction, ou n'importe où, vous pouvez soit : - Ouvrir [un ticket](https://framagit.org/hackinscience/hkis-website/issues). - M'en parler directement, je suis `mdk` sur [discuss.afpy.org](https://discuss.afpy.org), et sur freenode, ou par mail : [julien@palard.fr](mailto:julien@palard.fr).

source: Get help from the Python community
fr: Obtenir de l'aide de la communauté Python

source: The Python community is known to be friendly and welcoming, don't hesitate to ask for help! ### Asking on a forum There's a Python forum at [discuss.python.org](https://discuss.python.org), feel free to ask your question in the `Users` category. ### Asking in the chat You can ask in the `#python` channel of freenode, you can use [https://kiwi.freenode.net](https://kiwi.freenode.net) if you don't have an IRC client. ### Asking by mail There's the [python-list](https://mail.python.org/mailman/listinfo/python-list) mailing list. ### How to ask a question? Don't ask to ask, just ask. Be polite and respectfull. Don't ask for someone else to solve your exercise for you, it won't help you learn.
fr: La communauté Python est connue pour être amicale et bienveillante, n'hésitez pas à demander de l'aide ! ### Demander sur un forum L'association Francophone Python, l'AFPy, a un forum : [discuss.afpy.org](https://discuss.afpy.org), n'hésitez pas à utiliser la catégorie "Entraide". ### Demander sur un chat Vous pouvez demander de l'aide sur freenode (IRC), sur le salon `#python-fr`. Si vous n'avez pas de client IRC, utilisez: [https://kiwi.freenode.net](https://kiwi.freenode.net). ### Comment poser une question ? Soyez poli et respectueux. Ne demandez pas l'autorisation de poser une question, posez votre question directement. Ne demandez pas à ce que quelqu'un fasse votre exercice pour vous, ce n'est pas une bonne manière d'apprendre.

source: Frequently Asked Questions
fr: Foire Aux Questions

source: Can't connect to correction server?
fr: Connexion au serveur de correction impossible ?

source: If you have the correction server connection error, there's two main possibilities: Either your internet provider (or VPN, or ...) blocks [WebSockets](https://fr.wikipedia.org/wiki/WebSocket), in which case you should politely ask for them to update their blocking policy. Or my server is down (in which case you should not even be able to read this message). Anyway don't hesitate to open [an issue](https://framagit.org/hackinscience/hkis-website/issues) in the bug tracker, so I know.
fr: Si votre navigateur ne parvient pas à se connecter au serveur de correction, j'y voit deux raisons possibles : Soit votre fournisseur d'accès internet (ou votre VPN) bloque les [WebSockets](https://fr.wikipedia.org/wiki/WebSocket), auquel cas vous pouvez peut être leur demander de mettre à jour leur politique de blocage. Soit mon serveur est en carafe (mais alors, comment lisez-vous ce message ?). Dans tous les cas, dites le moi (ouvrez [un ticket](https://framagit.org/hackinscience/hkis-website/issues)), que je le sache.

source: My question is not in the FAQ, how to add it?
fr: Ma question n'est pas dans la FAQ, comment l'ajouter ?

source: Ask me, I'll reply, and if it's frequently asked, I'll add it here. You can ask me using by opening [an issue](https://framagit.org/hackinscience/hkis-website/issues), or send me an email: [julien@palard.fr](mailto:julien@palard.fr).
fr: Demandez moi ! J'y répondrai personnellement, et si la question revient fréquement, je l'ajouterai ici. Vous pouvez me demander en ouvrant [un ticket](https://framagit.org/hackinscience/hkis-website/issues), ou en m'envoyant un mail : [julien@palard.fr](mailto:julien@palard.fr).

source: Python course
fr: Cours de Python

source: Hackinscience is an interactive Python exercise platform: <br/> Write code, get instant feedback from our correction bot <br/> with detailed information about what went wrong so you'll never get stuck.
fr: Hackinscience est une plateforme interactive d'exercices pour le langage Python : <br/> Écrivez du code, obtenez un retour immédiat de notre robot correcteur <br/> avec des informations détaillées de ce qui s'est mal passé afin d'éviter tout blocage.

source: Sign in
fr: Connexion

source: Sign up
fr: Inscription

source: Exercises
fr: Exercices

source: Profile
fr: Profil

source: Stats
fr: Statistiques

source: Help
fr: Aide

source: About
fr: À propos

source: Log out
fr: Déconnexion

source: Donate using Liberapay
fr: Faire un don via Liberapay

source: Statistics
fr: Statistiques

source: You subscribed on %(date_joined)s, and sent %(submit_qty)s answers to the correction bot.
fr: Vous avez rejoint hackinscience le %(date_joined)s, et envoyé %(submit_qty)s réponses à la moulinette de correction.

source: You resolved %(done_qty)s exercises, that's %(done_pct)s of all exercises.
fr: Vous avez résolu %(done_qty)s exercices, c'est %(done_pct)s de tous les exercices.

source: You're ranking %(rank)s over %(participants)s participants.
fr: Vous êtes classé %(rank)s sur %(participants)s participants.

source: You're not ranked yet.
fr: Vous n'êtes pas encore classé.

source: Preferences
fr: Préférences

source: Change your password
fr: Changer de mot de passe

source: Update
fr: Mettre à jour

source: Solutions for exercise:
fr: Solutions de l'exercice :

source: Shared solutions
fr: Les solutions partagées

source: (You're not allowed to see them until you resolved the exercise.)
fr: (Vous n'êtes pas autorisé à les voir tant que vous n'avez pas résolu l'exercice.)

source: Solution shared by %(username)s on %(date)s:
fr: Solution partagée par %(username)s le %(date)s :

source: No solution shared yet :(
fr: Aucun solution partagée pour le moment :(

source: My answers
fr: Mes réponses

source: You haven't submitted anything for this exercise yet.
fr: Vous n'avez pas envoyé de réponse pour cet exercice pour le moment.

source: Submited on %(date)s:
fr: Envoyé le %(date)s :

source: Unshare it
fr: Annuler le partage

source: Share it with other students!
fr: Partagez votre solution avec les autres !

source: Groups
fr: Groupes

source: The team
fr: L'équipe

source: Contact us
fr: Contactez-nous

source: You can contact us by email at team at hackinscience dot org.
fr: Vous pouvez nous joindre par email à team at hackinscience point org.

source: Sign in to Hackinscience
fr: Se connecter à Hackinscience

source: Forgot your password?
fr: Mot de passe oublié ?

source: New to Hackinscience?
fr: Nouveau sur Hackinscience ?

source: Create an account.
fr: Créer un compte.

source: Change password
fr: Changer de mot de passe

source: Back
fr: Retour

source: Confirm password reset
fr: Confirmer le changement de mot de passe

source: Enter your new password below to reset your password:
fr: Entrez votre nouveau mot de passe ci-dessous pour le réinitialiser :

source: Set password
fr: Changer le mot de passe

source: Password reset unsuccessful. Please <a href="{{ url }}">try again.</a>
fr: Le reset du mot de passe a échoué. Merci <a href="{{ url }}">de réessayer.</a>

source: Reset password
fr: Réinitiation de mot de passe

source: Register
fr: S'enregistrer
