Repository: hackinscience/hkis-website
Catalog: website/locale/*/LC_MESSAGES/djangojs.po
Languages: fr

source: This will send this answer to a human for manual review, so it can be enhanced, are you sure?
fr: Cette réponse sera envoyée à un human pour relecture, dans l'espoir de l'améliorer. L'envoyer maintenant ?

source: Your new <a href="%(url)s">rank</a> is: %(new_rank)s
fr: Votre nouveau <a href="%(url)s">classement</a> est: %(new_rank)s

source: <a href="%s">Login</a> to backup your code and progression.
fr: <a href="%s">Connectez-vous</a> pour sauvegarder votre code et votre progression.

source: Flag this answer as particularly unhelpfull, It'll be reviewed by a human.
fr: Marquer cette correction comme particulièrement innutile, un humain passera la relire.

source: Report
fr: Signaler

source: Reported
fr: Signalé

source: Thanks for the feedback!
fr: Merci, je regarde ça bientôt !

source: Waiting for correction...
fr: Correction en cours…

source: Waiting for test run
fr: Exécution en cours…

source: Connecting to correction server…
fr: Connexion au serveur de correction en cours…

source: Connected to correction server.
fr: Connecté au serveur de correction!

source: Connection to correction server lost, will retry in 5s…
fr: La connexion au serveur de correction a échouée. Nouvelle tentative dans 5s…

source: Cannot connect to correction server, will retry in 5s…
fr: Impossible de se connecter au serveur de correction. Nouvelle tentative dans 5s…
